
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать документа)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДокумента(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДокумента(ТабДок, ПараметрКоманды)
	Документы.ОказаниеУслуги.ПечатьДокумента(ТабДок, ПараметрКоманды);
КонецПроцедуры
